## Production: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to move, 16 to add, 4 to change, 8 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                             |
|----------|-------------------------------------------------------------|
| add      | `aws_cloudwatch_log_group.user_portal`                      |
|          | `aws_ecs_cluster.idp`                                       |
|          | `aws_ecs_task_definition.user_portal`                       |
|          | `aws_iam_policy.ecs_xray`                                   |
|          | `aws_iam_policy.user_portal_ssm`                            |
|          | `aws_iam_role.idp_user_portal`                              |
|          | `aws_iam_role_policy_attachment.ecs_task_execution_forms`   |
|          | `aws_iam_role_policy_attachment.ecs_xray`                   |
|          | `aws_iam_role_policy_attachment.ssm_user_portal`            |
|          | `aws_ssm_parameter.idp_login_service_user_token`            |
| delete   | `module.idp_ecs.aws_ecs_cluster.this[0]`                    |
|          | `module.idp_ecs.aws_ecs_cluster_capacity_providers.this[0]` |
| update   | `aws_wafv2_web_acl.idp`                                     |
|          | `module.idp_ecs.aws_iam_policy.this_task_exec`              |
|          | `module.idp_ecs.aws_iam_role.this_task`                     |
|          | `module.idp_ecs.aws_iam_role.this_task_exec`                |
| recreate | `module.idp_ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`      |
|          | `module.idp_ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]`   |
|          | `module.idp_ecs.aws_appautoscaling_target.this[0]`          |
|          | `module.idp_ecs.aws_cloudwatch_log_group.this`              |
|          | `module.idp_ecs.aws_ecs_service.this`                       |
|          | `module.idp_ecs.aws_ecs_task_definition.this`               |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/21069382898).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.idp_login_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "idp_login_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # aws_cloudwatch_log_group.user_portal will be created
  + resource "aws_cloudwatch_log_group" "user_portal" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "user_portal"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_ecs_cluster.idp will be created
  + resource "aws_ecs_cluster" "idp" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "auth"
      + region   = "ca-central-1"
      + tags_all = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.user_portal will be created
  + resource "aws_ecs_task_definition" "user_portal" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "user_portal"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + region                   = "ca-central-1"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.ecs_xray will be created
  + resource "aws_iam_policy" "ecs_xray" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for allowing X-Ray tracing"
      + id               = (known after apply)
      + name             = "idp_ecs_xray"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.user_portal_ssm will be created
  + resource "aws_iam_policy" "user_portal_ssm" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "IdpS3Access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.idp_user_portal will be created
  + resource "aws_iam_role" "idp_user_portal" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "idp_user_portal"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_forms will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_forms" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "idp_user_portal"
    }

  # aws_iam_role_policy_attachment.ecs_xray will be created
  + resource "aws_iam_role_policy_attachment" "ecs_xray" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "idp_user_portal"
    }

  # aws_iam_role_policy_attachment.ssm_user_portal will be created
  + resource "aws_iam_role_policy_attachment" "ssm_user_portal" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "idp_user_portal"
    }

  # aws_route53_record.idp has moved to aws_route53_record.idp[0]
    resource "aws_route53_record" "idp" {
        id                               = "Z1031499PBK3926Y7HKK_auth.forms-formulaires.alpha.canada.ca_A"
        name                             = "auth.forms-formulaires.alpha.canada.ca"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ssm_parameter.idp_login_service_user_token will be created
  + resource "aws_ssm_parameter" "idp_login_service_user_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "idp_login_service_user_token"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_wafv2_web_acl.idp will be updated in-place
  ~ resource "aws_wafv2_web_acl" "idp" {
        id                          = "399b414e-14cc-4120-93f6-829fbdc5c275"
        name                        = "idp"
        tags                        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      - rule {
          - name     = "BlockLargeRequests" -> null
          - priority = 1 -> null

          - action {
              - block {
                }
            }

          - statement {
              - or_statement {
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - cookies {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_cookies = [] -> null
                                      - included_cookies = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                  - statement {
                      - size_constraint_statement {
                          - comparison_operator = "GT" -> null
                          - size                = 8192 -> null

                          - field_to_match {
                              - headers {
                                  - match_scope       = "ALL" -> null
                                  - oversize_handling = "MATCH" -> null

                                  - match_pattern {
                                      - excluded_headers = [] -> null
                                      - included_headers = [] -> null

                                      - all {}
                                    }
                                }
                            }

                          - text_transformation {
                              - priority = 0 -> null
                              - type     = "NONE" -> null
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "BlockLargeRequests" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "BlockLargeRequests"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + or_statement {
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + cookies {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_cookies = []
                                      + included_cookies = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + size_constraint_statement {
                          + comparison_operator = "GT"
                          + size                = 8192

                          + field_to_match {
                              + headers {
                                  + match_scope       = "ALL"
                                  + oversize_handling = "MATCH"

                                  + match_pattern {
                                      + excluded_headers = []
                                      + included_headers = []

                                      + all {}
                                    }
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockLargeRequests"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.data.aws_ecs_cluster.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_cluster" "this" {
      + arn                                  = (known after apply)
      + cluster_name                         = "auth"
      + id                                   = (known after apply)
      + pending_tasks_count                  = (known after apply)
      + region                               = (known after apply)
      + registered_container_instances_count = (known after apply)
      + running_tasks_count                  = (known after apply)
      + service_connect_defaults             = (known after apply)
      + setting                              = (known after apply)
      + status                               = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_secret_key",
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_name",
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_database_host",
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_username",
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/zitadel_admin_password",
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_username",
                              + "arn:aws:ssm:ca-central-1:957818836222:parameter/idp_database_cluster_admin_password",
                            ]
                          + Sid      = "GetSSMParameters"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this_task_exec_ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.idp_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.idp_ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.idp_ecs.aws_appautoscaling_policy.this["cpu"] must be replaced
-/+ resource "aws_appautoscaling_policy" "this" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/idp/zitadel-AlarmHigh-78c33a4f-d51d-4b27-b57e-ef661562e179",
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/idp/zitadel-AlarmLow-75e35c6e-0d95-4ed9-9660-9b37b8e6aae4",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:957818836222:scalingPolicy:ecc92945-179b-493a-9d0e-1b56f88d05a2:resource/ecs/service/idp/zitadel:policyName/cpu" -> (known after apply)
      ~ id                 = "cpu" -> (known after apply)
        name               = "cpu"
      ~ resource_id        = "service/idp/zitadel" -> "service/auth/zitadel" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.idp_ecs.aws_appautoscaling_policy.this["memory"] must be replaced
-/+ resource "aws_appautoscaling_policy" "this" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/idp/zitadel-AlarmHigh-6f467c33-87c3-4584-b3e6-a629158aaa37",
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/idp/zitadel-AlarmLow-05a5317b-7329-49f3-bb10-d7314acf54ae",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:957818836222:scalingPolicy:ecc92945-179b-493a-9d0e-1b56f88d05a2:resource/ecs/service/idp/zitadel:policyName/memory" -> (known after apply)
      ~ id                 = "memory" -> (known after apply)
        name               = "memory"
      ~ resource_id        = "service/idp/zitadel" -> "service/auth/zitadel" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.idp_ecs.aws_appautoscaling_target.this[0] must be replaced
-/+ resource "aws_appautoscaling_target" "this" {
      ~ arn                = "arn:aws:application-autoscaling:ca-central-1:957818836222:scalable-target/0ec5ecc92945179b493a9d0e1b56f88d05a2" -> (known after apply)
      ~ id                 = "service/idp/zitadel" -> (known after apply)
      ~ resource_id        = "service/idp/zitadel" -> "service/auth/zitadel" # forces replacement
      ~ role_arn           = "arn:aws:iam::957818836222:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
        tags               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

      ~ suspended_state (known after apply)
      - suspended_state {
          - dynamic_scaling_in_suspended  = false -> null
          - dynamic_scaling_out_suspended = false -> null
          - scheduled_scaling_suspended   = false -> null
        }
    }

  # module.idp_ecs.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/ecs/idp/zitadel" -> (known after apply)
      ~ id                = "/aws/ecs/idp/zitadel" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/ecs/idp/zitadel" -> "/aws/ecs/auth/zitadel" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.idp_ecs.aws_ecs_cluster.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_ecs_cluster" "this" {
      - arn      = "arn:aws:ecs:ca-central-1:957818836222:cluster/idp" -> null
      - id       = "arn:aws:ecs:ca-central-1:957818836222:cluster/idp" -> null
      - name     = "idp" -> null
      - region   = "ca-central-1" -> null
      - tags     = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # module.idp_ecs.aws_ecs_cluster_capacity_providers.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_ecs_cluster_capacity_providers" "this" {
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - cluster_name       = "idp" -> null
      - id                 = "idp" -> null
      - region             = "ca-central-1" -> null

      - default_capacity_provider_strategy {
          - base              = 1 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }
    }

  # module.idp_ecs.aws_ecs_service.this must be replaced
-/+ resource "aws_ecs_service" "this" {
      + arn                                = (known after apply)
      ~ cluster                            = "idp" -> "auth" # forces replacement
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:957818836222:service/idp/zitadel" -> (known after apply)
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "zitadel:42" -> (known after apply)
      ~ triggers                           = {} -> (known after...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
